Revit 2026 API

# TileTilePerRow Property

---

The property labeled "Every" from the "Tile" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string TilePerRow { get; }
```
```vb
Public Shared ReadOnly Property TilePerRow As String
	Get
```
```cpp
public:
static property String^ TilePerRow {
	String^ get ();
}
```
```fsharp
static member TilePerRow : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" within the range of "0, 50".

#### Reference

Tile Class

Autodesk.Revit.DB.Visual Namespace